In [3]:
import pandas as pd
import numpy as np

In [11]:
df = pd.read_csv('data_ptbas.csv',
                 header = 1,
                 #skiprows = 1,
                 engine = 'python',
                 skipfooter = 2)

# DATA PEGAWAI PT. BAS 2020

In [14]:
df.set_index('NO')

        NAMA  USIA      KOTA      GAJI
NO
1      Yuyun    36  Surabaya   6500000
2   Veronika    29  Wonogiri   4500000
3        Eko    46   Nganjuk   3750000
4       Ecky    32   Bau-Bau   6500000
5       Aziz    27    Madura   5000000
6       Tono    55   Jakarta  10000000

In [16]:
df['NAMA']

0       Yuyun
1    Veronika
2         Eko
3        Ecky
4        Aziz
5        Tono
Name: NAMA, dtype: object

In [19]:
df['GAJI'].describe().loc['max']

10000000.0

In [20]:
df['GAJI'].max()

10000000

In [21]:
df['GAJI'].mean()

6041666.666666667

In [22]:
df['GAJI'].mode()

0    6500000
dtype: int64

In [23]:
df['GAJI'].sum()

36250000

In [24]:
df['GAJI'].median()

5750000.0

In [26]:
df[df['GAJI'] == df['GAJI'].min()]

   NO NAMA  USIA     KOTA     GAJI
2   3  Eko    46  Nganjuk  3750000

In [27]:
df[df['GAJI'] == df['GAJI'].min()][['NAMA','USIA','GAJI']]

  NAMA  USIA     GAJI
2  Eko    46  3750000

In [29]:
df[df['USIA'] == df['USIA'].max()]

   NO  NAMA  USIA     KOTA      GAJI
5   6  Tono    55  Jakarta  10000000

In [35]:
df[df['USIA'] <= 40]

   NO      NAMA  USIA      KOTA     GAJI
0   1     Yuyun    36  Surabaya  6500000
1   2  Veronika    29  Wonogiri  4500000
3   4      Ecky    32   Bau-Bau  6500000
4   5      Aziz    27    Madura  5000000

In [41]:
df[(df['USIA'] <= 40) & (df['KOTA'] != 'Surabaya') | (df['GAJI'] < 6500000)]

   NO      NAMA  USIA      KOTA     GAJI
1   2  Veronika    29  Wonogiri  4500000
2   3       Eko    46   Nganjuk  3750000
3   4      Ecky    32   Bau-Bau  6500000
4   5      Aziz    27    Madura  5000000

In [40]:
df[df['USIA'].between(35, 55)]

   NO   NAMA  USIA      KOTA      GAJI
0   1  Yuyun    36  Surabaya   6500000
2   3    Eko    46   Nganjuk   3750000
5   6   Tono    55   Jakarta  10000000